posts/1912-clojure-reagent-partial.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-21 Tue 14:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ClojureScript tip: about reagent &amp; partials</title>
<meta name="generator" content="Org mode" />
<link rel='stylesheet' type='text/css' href='../css/default.css' />
<link rel='stylesheet' type='text/css' href='../css/style.css' />
<link rel='stylesheet' type='text/css' href='../css/code.css' />
<meta name='viewport' content='width=device-width, initial-scale=1.0' />

</head>
<body>
<div id="preamble" class="status">
<div class="header">
  <a href="../index.html">
    <span class="actondev act">ACT</span><span class="actondev on">ON</span><span class="actondev dev">DEV</span>
  </a>
  <span>Development, philosophy, writing</span>
</div>
<h1 class='title'>ClojureScript tip: about reagent & partials<br/><span class='subtitle date'>2019-12-09</span></h1>
</div>
<div id="content">

<div id="outline-container-orga91acbe" class="outline-2">
<h2 id="orga91acbe">From singleton to reusable</h2>
<div class="outline-text-2" id="text-orga91acbe">
<p>
During the development of a personal project, I first had my cljs namespaces dealing with state in a <b>singleton</b> kind of structure. One state <code>atom</code> and that's it. Transitioning to a reusable logic meant that I had to start passing around the <code>state</code>. All I have to do for that is to add <code>*state</code> as the first argument in any function that deals with the state.
</p>

<p>
A "problem" appeared when I relaized I was passing around components in some custom functions that I had written (ie parsing tree maps and rendering leaf nodes with the provided element)
</p>

<p>
Picture this
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #e91e63;">(</span><span style="color: #fb2874;">defn</span> <span style="color: #b6e63e;">draw-leaf-nodes</span>
  <span style="color: #7f7f80;">"You pass a map and it renders using the leaf-elem all the leafs which branch under the branch-key</span>

<span style="color: #7f7f80;">  Example m (with branch-key :steps)</span>
<span style="color: #7f7f80;">  {:steps</span>
<span style="color: #7f7f80;">   [{:level-0-leaf true}</span>
<span style="color: #7f7f80;">    {:steps [{:level-1-leaf true}</span>
<span style="color: #7f7f80;">             {:level-1-leaf true}]}]}"</span>
  <span style="color: #2196F3;">[</span>m branch-key leaf-elem<span style="color: #2196F3;">]</span>
  <span style="color: #e2c770;">"the code.."</span><span style="color: #e91e63;">)</span>
</pre>
</div>

<p>
In my first implementation I could easily pass an element like this
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #e91e63;">(</span><span style="color: #fb2874;">defun</span> <span style="color: #b6e63e;">element</span>
  <span style="color: #e2c770;">"NOTE! *state is global in this namespace"</span>
  <span style="color: #2196F3;">[]</span>
  <span style="color: #2196F3;">[</span><span style="color: #fd971f;">:div</span> <span style="color: #EF6C00;">{</span><span style="color: #fd971f;">:on-click</span> #<span style="color: #B388FF;">(</span>swap! *state update <span style="color: #fd971f;">:click-count</span> inc<span style="color: #B388FF;">)</span><span style="color: #EF6C00;">}</span><span style="color: #2196F3;">]</span><span style="color: #e91e63;">)</span>
</pre>
</div>

<p>
And in the passed element I could modify the state. But as we said before, during the refactoring process, to make the namespace reusable, I have to pass around the <code>*state</code> and not use a global state. So, our element becomes
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #e91e63;">(</span><span style="color: #fb2874;">defun</span> <span style="color: #b6e63e;">element</span>
  <span style="color: #e2c770;">"NOTE! *state is passed in the function"</span>
  <span style="color: #2196F3;">[</span>*state<span style="color: #2196F3;">]</span>
  <span style="color: #2196F3;">[</span><span style="color: #fd971f;">:div</span> <span style="color: #EF6C00;">{</span><span style="color: #fd971f;">:on-click</span> #<span style="color: #B388FF;">(</span>swap! *state update <span style="color: #fd971f;">:click-count</span> inc<span style="color: #B388FF;">)</span><span style="color: #EF6C00;">}</span><span style="color: #2196F3;">]</span><span style="color: #e91e63;">)</span>
</pre>
</div>

<p>
Perfect! But now how do we pass around this element in that <code>draw-leaf-nodes</code> function?
</p>
</div>
</div>

<div id="outline-container-org0c912aa" class="outline-2">
<h2 id="org0c912aa">Enter partials</h2>
<div class="outline-text-2" id="text-org0c912aa">
<p>
<code>partial</code> is a greate &amp; quick way to pass around a new function where you "fix" the first n arguments yourself.
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #e91e63;">(</span><span style="color: #fb2874;">defn</span> <span style="color: #b6e63e;">partial</span>
  <span style="color: #7f7f80;">"Takes a function f and fewer than the normal arguments to f, and</span>
<span style="color: #7f7f80;">  returns a fn that takes a variable number of additional args. When</span>
<span style="color: #7f7f80;">  called, the returned function calls f with args + additional args."</span>
  <span style="color: #2196F3;">(</span><span style="color: #EF6C00;">[</span>f<span style="color: #EF6C00;">]</span> f<span style="color: #2196F3;">)</span>
  <span style="color: #2196F3;">(</span><span style="color: #EF6C00;">[</span>f arg1<span style="color: #EF6C00;">]</span>
   <span style="color: #EF6C00;">(</span><span style="color: #fb2874;">fn</span>
     <span style="color: #B388FF;">(</span><span style="color: #76ff03;">[]</span> <span style="color: #76ff03;">(</span>f arg1<span style="color: #76ff03;">)</span><span style="color: #B388FF;">)</span>
     <span style="color: #B388FF;">(</span><span style="color: #76ff03;">[</span>x<span style="color: #76ff03;">]</span> <span style="color: #76ff03;">(</span>f arg1 x<span style="color: #76ff03;">)</span><span style="color: #B388FF;">)</span>
     <span style="color: #B388FF;">(</span><span style="color: #76ff03;">[</span>x y<span style="color: #76ff03;">]</span> <span style="color: #76ff03;">(</span>f arg1 x y<span style="color: #76ff03;">)</span><span style="color: #B388FF;">)</span>
     <span style="color: #B388FF;">(</span><span style="color: #76ff03;">[</span>x y z<span style="color: #76ff03;">]</span> <span style="color: #76ff03;">(</span>f arg1 x y z<span style="color: #76ff03;">)</span><span style="color: #B388FF;">)</span>
     <span style="color: #B388FF;">(</span><span style="color: #76ff03;">[</span>x y z &amp; args<span style="color: #76ff03;">]</span> <span style="color: #76ff03;">(</span>apply f arg1 x y z args<span style="color: #76ff03;">)</span><span style="color: #B388FF;">)</span><span style="color: #EF6C00;">)</span><span style="color: #2196F3;">)</span>
  <span style="color: #555556;">;; </span><span style="color: #555556;">and goes on..</span>
  <span style="color: #e91e63;">)</span>
</pre>
</div>

<p>
So now I can pass
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #e91e63;">(</span>partial element *state<span style="color: #e91e63;">)</span>
</pre>
</div>

<p>
to the <code>draw-leaf-nodes</code>.
</p>
</div>
</div>
<div id="outline-container-orge582fc0" class="outline-2">
<h2 id="orge582fc0">Reagent re-rendering</h2>
<div class="outline-text-2" id="text-orge582fc0">
<p>
In my scenario, I noticed that now reagent was rerendering this partial element even though it didn't change. Just because in a higher level some state changed. But this particular element didn't need redrawing, so.. what gives?
</p>

<p>
Turns out that each time I was calling
</p>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #e91e63;">(</span>draw-leaf-nodes <span style="color: #2196F3;">(</span>partial element *state<span style="color: #2196F3;">)</span><span style="color: #e91e63;">)</span>
</pre>
</div>

<p>
I was passing around a new function. To put it simply
</p>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #e91e63;">(</span>= <span style="color: #2196F3;">(</span>partial element *state<span style="color: #2196F3;">)</span> <span style="color: #2196F3;">(</span>partial element *state<span style="color: #2196F3;">)</span><span style="color: #e91e63;">)</span>
</pre>
</div>
<p>
will return false. So it turns out that I was calling the <code>draw-leaf-nodes</code> each time with a different argument, causing it to rerender!
</p>
</div>

<div id="outline-container-orgb314298" class="outline-3">
<h3 id="orgb314298">Solution</h3>
<div class="outline-text-3" id="text-orgb314298">
<p>
<a href="https://clojuredocs.org/clojure.core/memoize">Memoize</a> to the resque
</p>

<p>
<code>(memoize f)</code>
</p>
<blockquote>
<p>
   Returns a memoized version of a referentially transparent function. The
memoized version of the function keeps a cache of the mapping from arguments
to results and, when calls with the same arguments are repeated often, has
higher performance at the expense of higher memory use.
</p>
</blockquote>

<p>
So now I can use the memoized version of <code>partial</code> like this
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #e91e63;">(</span><span style="color: #fb2874;">def</span> <span style="color: #fd971f;">mem-partial</span> <span style="color: #2196F3;">(</span>memoize partial<span style="color: #2196F3;">)</span><span style="color: #e91e63;">)</span>
</pre>
</div>

<p>
Thus I can call
</p>
<div class="org-src-container">
<pre class="src src-clojure">  <span style="color: #e91e63;">(</span>draw-leaf-nodes <span style="color: #2196F3;">(</span>mem-partial element *state<span style="color: #2196F3;">)</span><span style="color: #e91e63;">)</span>
</pre>
</div>

<p>
without causing rerenders!
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<h2>Comments</h2>
Leave your comments below

<div id="disqus_thread"></div>
<script>
  var disqus_config = function () {
  this.page.url = "";  // Replace PAGE_URL with your page's canonical URL variable
  this.page.identifier = "1912-clojure-reagent-partial"; // Replace PAGE_IDENTIFIER with your page's unique identifier variable
  };
  
  (function() { // DON'T EDIT BELOW THIS LINE
  var d = document, s = d.createElement('script');
  s.src = 'https://actondev-blog.disqus.com/embed.js';
  s.setAttribute('data-timestamp', +new Date());
  (d.head || d.body).appendChild(s);
  })();
</script>
<noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
</div>
</body>
</html>
